[
    {
        "dog": "archer",
        "stars": 5,
        "name": "Judy & Steve",
        "review": "Our daughter recommended we board our dog with Tenal, being familiar with her training experience, love of dogs, and work fostering rescues with behavioural challenges. Our boy Archer, a rescue who sings arias when frustrated, had a wonderful stay with Tenal. How do we know? Tenal’s photos, video clips, and updates showed us that Archer was getting lots of exercise, both physical and mental, and exposure to many new enrichment activities (a number of which we’ve already adopted). Further, <b>Tenal and her partner Ryan seemed to treat Archer like he was their own dog, which meant he wasn’t short on much-loved cuddles. Archer came home tired, calmer, and happy. All in all, we learned a lot from Tenal during Archer’s 7-day stay</b>, his first-ever boarding since we adopted him just under 2 years ago. We live four hours away, but without hesitation, we would board Archer with Tenal again. In fact, we're sure Archer is dreaming of his next stay!"
    },
    {
        "dog": "louis",
        "stars": 5,
        "name": "Samantha & Ben",
        "review": "From the moment we first met Tenal we knew our little Lou would be in the safest pair of hands - which is exactly what every pet parent wants when they go away. As first time boarders, we knew we wanted someone who would have the time, energy, and patience to look after Louis while we were away. <b>Tenal went above and beyond - taking the time to understand Louis, his needs, and how to keep him busy and engaged</b> for two weeks. Her check-ins were amazing, and we could tell from afar just how much he was enjoying his time. We would highly recommend Tenal to anyone looking to board their pup - not only will they leave just as happy and healthy as you left them - but you'll also have peace of mind that they're in a loving and caring environment throughout their stay. Thanks for taking care of our little guy, Tenal! We're still so grateful! He'll definitely be back :)"
    },
    {
        "dog": "loki",
        "stars": 5,
        "name": "Jessica & Patric",
        "review": "Our experience with Tenal caring for Loki was beyond our expectations. Loki is a rescue and had a really rough start and can be nervous in new situations and she took so much time and care in making him comfortable. Not only was he able to be comfortable in their care, it is clear that he felt completely safe and loved with Tenal and Ryan. Tenal really took the time to understand his needs, and provided him with a great deal of engagement and care. I also really enjoyed following along with how Loki was doing via  the Instagram page. <b>It provided me so much comfort and joy to see him thriving while I was away on vacation. I cannot recommend this service enough</b> and needless to say, Loki will be back for all our future travel."
    },
    {
        "dog": "aurelio",
        "stars": 5,
        "name": "Emily",
        "review": "Tenal has taken care of my rescue dog Aurelio many times (including fostering him before I met him!) and I am so happy he has such a good place to go when I am away. <b>She is extremely diligent and careful, and she goes above expectations to understand Aurelio’s specific needs to ensure that he has a safe and enriching stay</b> when boarding with her. Aurelio is a big, excitable bully breed and she ensures he gets enough enrichment and manages his big personality. I would recommend boutique boarding to anyone looking for a safe and fun place for their dog!"
    },
    {
        "dog": "hennessy",
        "stars": 5,
        "name": "Vincent",
        "review": "<b>Hennessy had a blast with you guys. Highly recommend boutique boarding</b> services for any of your dog sitting needs. We were very happy with the services and they always provided constant feedback which made us feel super comfortable!"
    },
    {
        "dog": "koda",
        "stars": 5,
        "name": "Shireen & Patric",
        "review": "Tenal was amazing with our dog Koda. Her professionalism and love for dogs was shown thru her daily updates and pics while we were on holidays. She was very well organized and thorough with her expectations and itinerary of Koda’s boarding stay. <b>We went with her after our meet and greet, as we saw her bio, with her experience, knowledge and her sincere love for what she does</b>! We knew Koda was in a safe and happy place. We have found a safe and happy place for our next holidays or daycare. Thanks a million Tenal 😊"
    }
]
