[
    {
        "dog": "louis",
        "stars": 5,
        "name": "Samantha & Ben",
        "review": "From the moment we first met Tenal we knew our little Lou would be in the safest pair of hands - which is exactly what every pet parent wants when they go away. As first time boarders, we knew we wanted someone who would have the time, energy, and patience to look after Louis while we were away. <b>Tenal went above and beyond - taking the time to understand Louis, his needs, and how to keep him busy and engaged</b> for two weeks. Her check-ins were amazing, and we could tell from afar just how much he was enjoying his time. We would highly recommend Tenal to anyone looking to board their pup - not only will they leave just as happy and healthy as you left them - but you'll also have peace of mind that they're in a loving and caring environment throughout their stay. Thanks for taking care of our little guy, Tenal! We're still so grateful! He'll definitely be back :)"
    },
    {
        "dog": "aurelio",
        "stars": 5,
        "name": "Emily",
        "review": "Tenal has taken care of my rescue dog Aurelio many times (including fostering him before I met him!) and I am so happy he has such a good place to go when I am away. <b>She is extremely diligent and careful, and she goes above expectations to understand Aurelio’s specific needs to ensure that he has a safe and enriching stay</b> when boarding with her. Aurelio is a big, excitable bully breed and she ensures he gets enough enrichment and manages his big personality. I would recommend boutique boarding to anyone looking for a safe and fun place for their dog!"
    },
    {
        "dog": "koda",
        "stars": 5,
        "name": "Shireen & Patric",
        "review": "Tenal was amazing with our dog Koda. Her professionalism and love for dogs was shown thru her daily updates and pics while we were on holidays. She was very well organized and thorough with her expectations and itinerary of Koda’s boarding stay. <b>We went with her after our meet and greet, as we saw her bio, with her experience, knowledge and her sincere love for what she does</b>! We knew Koda was in a safe and happy place. We have found a safe and happy place for our next holidays or daycare. Thanks a million Tenal 😊"
    }
]
